In [2]:
import pandas as pd
import datetime
import jdatetime as jd

In [3]:
datas = pd.read_json('response1.json')
datas['result']

0        {'id': 296545723, 'requestNumber': 99, 'creati...
1        {'id': 296525406, 'requestNumber': 1372, 'crea...
2        {'id': 296525409, 'requestNumber': 1373, 'crea...
3        {'id': 296544602, 'requestNumber': 1374, 'crea...
4        {'id': 296544605, 'requestNumber': 1375, 'crea...
                               ...
29755    {'id': 339598439, 'requestNumber': 34653, 'cre...
29756    {'id': 339598523, 'requestNumber': 34654, 'cre...
29757    {'id': 339599294, 'requestNumber': 34655, 'cre...
29758    {'id': 339599675, 'requestNumber': 34656, 'cre...
29759    {'id': 339600076, 'requestNumber': 34657, 'cre...
Name: result, Length: 29760, dtype: object

In [4]:
chosen_keys = ['creationDate','paymentRequestDate','requestAmount']
df = pd.json_normalize(datas['result'])
df = df[chosen_keys]
df

      creationDate paymentRequestDate  requestAmount
0       1402/05/30         1402/06/01        4777240
1       1402/05/30         1402/06/01      500000000
2       1402/05/30         1402/06/01      140752404
3       1402/05/30         1402/06/01      500000000
4       1402/05/30         1402/06/01      290847290
...            ...                ...            ...
29755   1403/03/27         1403/03/27       53815533
29756   1403/03/27         1403/03/27       50000000
29757   1403/03/27         1403/03/27       47140000
29758   1403/03/27         1403/03/27       76500000
29759   1403/03/27         1403/03/27       55000000

[29760 rows x 3 columns]

In [5]:
df['creationDate'] = df['creationDate'].astype(str)
df['paymentRequestDate'] = df['paymentRequestDate'].astype(str)
df

      creationDate paymentRequestDate  requestAmount
0       1402/05/30         1402/06/01        4777240
1       1402/05/30         1402/06/01      500000000
2       1402/05/30         1402/06/01      140752404
3       1402/05/30         1402/06/01      500000000
4       1402/05/30         1402/06/01      290847290
...            ...                ...            ...
29755   1403/03/27         1403/03/27       53815533
29756   1403/03/27         1403/03/27       50000000
29757   1403/03/27         1403/03/27       47140000
29758   1403/03/27         1403/03/27       76500000
29759   1403/03/27         1403/03/27       55000000

[29760 rows x 3 columns]

In [6]:
df['paymentRequestDate'] = df['paymentRequestDate'].apply(lambda x : x.split('/'))
df['creationDate'] = df['creationDate'].apply(lambda x : x.split('/'))

In [7]:
df

         creationDate paymentRequestDate  requestAmount
0      [1402, 05, 30]     [1402, 06, 01]        4777240
1      [1402, 05, 30]     [1402, 06, 01]      500000000
2      [1402, 05, 30]     [1402, 06, 01]      140752404
3      [1402, 05, 30]     [1402, 06, 01]      500000000
4      [1402, 05, 30]     [1402, 06, 01]      290847290
...               ...                ...            ...
29755  [1403, 03, 27]     [1403, 03, 27]       53815533
29756  [1403, 03, 27]     [1403, 03, 27]       50000000
29757  [1403, 03, 27]     [1403, 03, 27]       47140000
29758  [1403, 03, 27]     [1403, 03, 27]       76500000
29759  [1403, 03, 27]     [1403, 03, 27]       55000000

[29760 rows x 3 columns]

In [8]:
df2 = df.copy()
df2['paymentRequestDate'] = [list(map(int, sublist)) for sublist in df2['paymentRequestDate']]
df2['creationDate'] = [list(map(int, sublist)) for sublist in df2['creationDate']]
df2

        creationDate paymentRequestDate  requestAmount
0      [1402, 5, 30]       [1402, 6, 1]        4777240
1      [1402, 5, 30]       [1402, 6, 1]      500000000
2      [1402, 5, 30]       [1402, 6, 1]      140752404
3      [1402, 5, 30]       [1402, 6, 1]      500000000
4      [1402, 5, 30]       [1402, 6, 1]      290847290
...              ...                ...            ...
29755  [1403, 3, 27]      [1403, 3, 27]       53815533
29756  [1403, 3, 27]      [1403, 3, 27]       50000000
29757  [1403, 3, 27]      [1403, 3, 27]       47140000
29758  [1403, 3, 27]      [1403, 3, 27]       76500000
29759  [1403, 3, 27]      [1403, 3, 27]       55000000

[29760 rows x 3 columns]

In [9]:
def format_date(data, col):    
    for index, row in data.iterrows():
            year = int(row[col][0])  # Extract year as integer
            month = int(row[col][1])  # Extract month as integer
            day = int(row[col][2])  # Extract day as integer
            # Create a datetime object using jdatetime
            if month == 12 and day > 29:  # February has at most 29 days
                continue
                
            dt = jd.datetime(year=year, month=month, day=day).date()
            
            # Assign the datetime object to a new column or overwrite the existing one
            data.at[index, col] = dt

In [10]:
format_date(df2, 'paymentRequestDate')
format_date(df2, 'creationDate')
df2

      creationDate paymentRequestDate  requestAmount
0       1402-05-30         1402-06-01        4777240
1       1402-05-30         1402-06-01      500000000
2       1402-05-30         1402-06-01      140752404
3       1402-05-30         1402-06-01      500000000
4       1402-05-30         1402-06-01      290847290
...            ...                ...            ...
29755   1403-03-27         1403-03-27       53815533
29756   1403-03-27         1403-03-27       50000000
29757   1403-03-27         1403-03-27       47140000
29758   1403-03-27         1403-03-27       76500000
29759   1403-03-27         1403-03-27       55000000

[29760 rows x 3 columns]

In [11]:
data_set = df2.copy()
data_set

      creationDate paymentRequestDate  requestAmount
0       1402-05-30         1402-06-01        4777240
1       1402-05-30         1402-06-01      500000000
2       1402-05-30         1402-06-01      140752404
3       1402-05-30         1402-06-01      500000000
4       1402-05-30         1402-06-01      290847290
...            ...                ...            ...
29755   1403-03-27         1403-03-27       53815533
29756   1403-03-27         1403-03-27       50000000
29757   1403-03-27         1403-03-27       47140000
29758   1403-03-27         1403-03-27       76500000
29759   1403-03-27         1403-03-27       55000000

[29760 rows x 3 columns]

In [12]:
Dataframe = pd.DataFrame(data_set)
Dataframe

      creationDate paymentRequestDate  requestAmount
0       1402-05-30         1402-06-01        4777240
1       1402-05-30         1402-06-01      500000000
2       1402-05-30         1402-06-01      140752404
3       1402-05-30         1402-06-01      500000000
4       1402-05-30         1402-06-01      290847290
...            ...                ...            ...
29755   1403-03-27         1403-03-27       53815533
29756   1403-03-27         1403-03-27       50000000
29757   1403-03-27         1403-03-27       47140000
29758   1403-03-27         1403-03-27       76500000
29759   1403-03-27         1403-03-27       55000000

[29760 rows x 3 columns]

In [14]:
Dataframe.to_csv('Dataframe.csv', sep=',', index=False, encoding='utf-8')